# От конзолата се четат 3 реда:
# 1.	Брой страници в текущата книга – цяло число в интервала [1…1000]
# 2.	Страници, които прочита за 1 час – цяло число в интервала [1…1000]
# 3.	Броят на дните, за които трябва да прочете книгата – цяло число в интервала [1…1000]
# Изход
# Да се отпечата на конзолата броят часове, които Жоро трябва да отделя за четене всеки ден.
num_sheets=int(input())
sheets_per_hour=int(input())
num_of_days=int(input())

total_hour=num_sheets//sheets_per_hour
hour_for_reading=total_hour//num_of_days
print(hour_for_reading)